sdaiCreateComplexInstanceBN(Sdai_instS*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**)
\details
Creates a complex instance with the specified name.
\param model      [in] A model to create the complex instance within.
\param nameNumber [in] A number of instances included in the complex instance.
\param nameVector [in] A raw pointer to the array of names of instances included in the complex instance.
\returns A created complex application instance.